
&НаСервере
Процедура ЗаполнитьПустыеАртикулыНоменклатурыНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Товары.Ссылка КАК Ссылка,
	               |	Товары.Артикул КАК Артикул
	               |ИЗ
	               |	Справочник.Товары КАК Товары
	               |ГДЕ
	               |	Товары.Артикул = """"
	               |	И Товары.ПометкаУдаления = ЛОЖЬ";
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		обТовары = Выборка.Ссылка.ПолучитьОбъект();
		обТовары.Артикул = "<не заполнено>";
		Попытка 
			обТовары.Записать();
		Исключение
			Сообщить(ОписаниеОшибки());
		КонецПопытки;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПустыеАртикулыНоменклатуры(Команда)
	ЗаполнитьПустыеАртикулыНоменклатурыНаСервере();
КонецПроцедуры
